# -*- coding: utf-8 -*-

# 这是网易云音乐榜与榜单id的对照表
rank_id = {
    "云音乐飙升榜":"19723756",
    "云音乐新歌榜":"3779629",
    "网易原创歌曲榜":"2884035",
    "云音乐热歌榜":"3778678",
    "云音乐说唱榜":"991319590",
    "云音乐古典音乐榜":"71384707",
    "云音乐电音榜":"1978921795",
    "抖音排行榜":"2250011882",
    "新声榜":"2617766278",
    "云音乐ACG音乐榜":"71385702",
    "云音乐韩语榜":"745956260",
    "云音乐国电榜":"10520166",
    "英国Q杂志中文版周榜":"2023401535",
    "电竞音乐榜":"2006508653",
    "UK排行榜周榜":"180106",
    "美国Billboard周榜":"60198",
    "Beatport全球电子舞曲榜":"3812895",
    "KTV唛榜":"21845217",
    "iTunes榜":"11641012",
    "日本Oricon周榜":"60131",
    "Hit FM Top榜":"120001",
    "台湾Hito排行榜":"112463",
    "云音乐欧美热歌榜":"2809513713",
    "云音乐欧美新歌榜":"2809577409",
    "法国 NRJ Vos Hits 周榜":"27135204",
    "云音乐ACG动画榜":"3001835560",
    "云音乐ACG游戏榜":"3001795926",
    "云音乐ACG VOCALOID榜":"3001890046"
}